import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter_widget_from_html/flutter_widget_from_html.dart';
import '../../helpers/functions.dart';
import '../../helpers/styles.dart';

class PrivacyPolicyScreen extends StatelessWidget {


PrivacyPolicyScreen();

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.white,
      appBar: AppBar(
        elevation: 0,

        automaticallyImplyLeading: true,
        leading: IconButton(
          onPressed: () {
            pop(context);
          },
          icon: const Icon(
            Icons.arrow_back,
            color: Colors.white,
          ),
        ),
        title:  Text(
          "سياسة الخصوصية والاستخدام",
          style: TextStyle(color: Colors.white, fontFamily: "pnuR"),
        ),

      ),
      body: Padding(
        padding: EdgeInsets.symmetric(horizontal: 10,vertical: 20),
        child: SingleChildScrollView(
          child: HtmlWidget(

            kHtmlFR,

            textStyle: TextStyle(fontSize: 14, color:Colors.black),

          ),
        ),
      ),

    );
  }
}



const kHtmlFR = """
<li>الشروط والاحكام</li>
 <p>جمع المعلومات الشخصية</p>
<p>


قد يتم جمع وتخزين واستخدام المعلومات الشخصية التالية: معلومات حول جهاز الكمبيوتر الخاص بك بما في ذلك عنوان بروتوكول الإنترنت الخاص بك، والموقع الجغرافي، ونوع المتصفح والإصدار، ونظام التشغيل.
 معلومات حول زياراتك لهذا الموقع واستخدامه بما في ذلك مصدر الإحالة، ومدة الزيارة، وما تشاهده على الصفحة، ومسارات التصفح في الموقع.
 ورقم الهاتف  المعلومات التي تدخلها عند التسجيل في التطبيق، مثل عنوان بريدك الإلكتروني.
– على سبيل المثال، اسمك، صور ملفك الشخصي.
 المعلومات، مثل اسمك وعنوان بريدك الإلكتروني، التي تدخلها من أجل ارسال طلبات / أو الرسائل الإخبارية لدينا ؛
 المعلومات التي تدخلها أثناء استخدام الخدمات على تطبيقنا.
 المعلومات التي يتم إنشاؤها أثناء استخدام موقعنا الإلكتروني، بما في ذلك مواعيد وتكرار استخدامك للموقع والظروف التي تستخدم فيها الموقع.
المعلومات المتعلقة بأي شيء تشتريه، أو الخدمات التي تستخدمها، أو المعاملات التي تجريها من خلال تطبيقنا الإلكتروني، والتي تشمل اسمك وعنوانك ورقم هاتفك وعنوان بريدك الإلكتروني وتفاصيل بطاقة الائتمان.
–  المعلومات الواردة في أي مراسلات ترسلها إلينا عبر البريد الإلكتروني أو عبر موقعنا الإلكتروني، بما في ذلك المحتوى المشترك والبيانات الوصفية.
 أي معلومات شخصية أخرى ترسلها إلينا.

تنطبق هذه الشروط والاحكام ( الشروط و الاحكام) على وصولك الى التطبيق واستخدامه ( كما هو موضح ادناه) .
يتم تشغيل التطبيق بواسطة ( تطبيق اوامرك ) والشركات التابعة لها والشركات الزميلة والمرخص لها .
-انت تقر بأن ( تطبيق اوامرك) يوفر لك رخصة اعادة ابطال لأستخدام ميزات محدودة للتطبيق ولا تبيع التطبيق او ميزات او تقنيات واردة فيه.
من خلال الاستمرار فى استخدام التطبيق , فأنك توافق على الالتزام بهذه الشروط والاحكام يرجى التأكد من أنك تقرأ وتفهم كل هذه الشروط والاحكام قبل استخدام التطبيق والميزات الموجودة فيه . اذا وجدت ايا من الشروط والاحكام غير مقبول,فلا تمنح موافقتك على استخدام التطبيق او الاستفادة من اى من ميزاته.يجب ان تعمل موافقتك على هذه الشروط والاحكام على انها اتفاقية ملزمة وقابلة للتنفيذ قانونا بينك وبين ( تطبيق اوامرك) او الشركات التى تمثله قانونا فيما يتعلق بالميزات المعروضة/المتوفرة بأستخدام تطبيق الهاتف ( اوامرك).




</p>



""";